takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static bool     m_rr_interval_enabled = true;                       /**< Flag for enabling and disabling the registration of new RR interval measurements (the purpose of disabling this is just to test sending HRM without RR interval data. */
static uint16_t          m_conn_handle = BLE_CONN_HANDLE_INVALID;                   /**< Handle of the current connection. */
static bool              m_hts_meas_ind_conf_pending = false;                       /**< Flag to keep track of when an indication confirmation is pending. */
static sensorsim_cfg_t   m_battery_sim_cfg;                                         /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;                                       /**< Battery Level sensor simulator state. */
static sensorsim_cfg_t   m_temp_celcius_sim_cfg;                                    /**< Temperature simulator configuration. */
static sensorsim_state_t m_temp_celcius_sim_state;                                  /**< Temperature simulator state. */

static sensorsim_cfg_t   m_heart_rate_sim_cfg;                      /**< Heart Rate sensor simulator configuration. */
static sensorsim_state_t m_heart_rate_sim_state;                    /**< Heart Rate sensor simulator state. */
static sensorsim_cfg_t   m_rr_interval_sim_cfg;                     /**< RR Interval sensor simulator configuration. */
static sensorsim_state_t m_rr_interval_sim_state;                   /**< RR Interval sensor simulator state. */

static ble_uuid_t m_sr_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_HEART_RATE_SERVICE,           BLE_UUID_TYPE_BLE},
    {BLE_UUID_HEALTH_THERMOMETER_SERVICE,   BLE_UUID_TYPE_BLE},
    {BLE_UUID_BATTERY_SERVICE,              BLE_UUID_TYPE_BLE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE,   BLE_UUID_TYPE_BLE}
};

#define SAMPLES_IN_BUFFER 5
volatile uint8_t state = 1;

//static const nrf_drv_timer_t m_timer = NRF_DRV_TIMER_INSTANCE(0);
static const nrf_drv_timer_t m_timer = NRF_DRV_TIMER_INSTANCE(1);
static nrf_saadc_value_t     m_buffer_pool[2][SAMPLES_IN_BUFFER];
static nrf_ppi_channel_t     m_ppi_channel;
static uint32_t              m_adc_evt_counter;

/* TWI instance ID. */
#define TWI_INSTANCE_ID     0

//#ifdef BSP_BUTTON_0
//    #define PIN_IN BSP_BUTTON_0
#ifdef BSP_BUTTON_3
    #define PIN_IN BSP_BUTTON_3
#endif
#ifndef PIN_IN
    #error "Please indicate input pin"
#endif

//#ifdef BSP_LED_0
//    #define PIN_OUT BSP_LED_0
#ifdef BSP_LED_3
    #define PIN_OUT BSP_LED_3
#endif
#ifndef PIN_OUT
    #error "Please indicate output pin"
#endif

APP_TIMER_DEF(m_bh1792glc_timer_id);
//#define BH1792GLC_MEAS_INTERVAL         APP_TIMER_TICKS(1000)   //1 Hz Timer
#define BH1792GLC_MEAS_INTERVAL         APP_TIMER_TICKS(25)       //40 Hz Timer

/* Indicates if operation on TWI has ended (when received). */
static volatile bool m_xfer_done = false;

/* TWI instance. */
static const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);

volatile static bool twi_tx_done = false;
volatile static bool twi_rx_done = false;

bh1792_t      m_bh1792;
bh1792_data_t m_bh1792_dat;

int32_t i2c_write(uint8_t slv_adr, uint8_t reg_adr, uint8_t *reg, uint8_t reg_size);
int32_t i2c_read(uint8_t slv_adr, uint8_t reg_adr, uint8_t *reg, uint8_t reg_size);

#define BH1792_TWI_TIMEOUT 			10000 
#define BH1792_TWI_BUFFER_SIZE     	8 // 8byte = tx max(7) + addr(1)

uint8_t twi_tx_buffer[BH1792_TWI_BUFFER_SIZE];

static void advertising_start(bool erase_bonds);
static void temperature_measurement_send(void);

/**
 * @brief TWI events handler.
 */
void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch(p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            switch(p_event->xfer_desc.type)
            {
                case NRF_DRV_TWI_XFER_TX:
                    twi_tx_done = true;
                    break;
                case NRF_DRV_TWI_XFER_TXTX:
                    twi_tx_done = true;
                    break;
                case NRF_DRV_TWI_XFER_RX:
                    twi_rx_done = true;
                    m_xfer_done = true;
                    break;
                case NRF_DRV_TWI_XFER_TXRX:
                    twi_rx_done = true;
                    m_xfer_done = true;
                    break;
                default:
                    break;
            }
            break;
        case NRF_DRV_TWI_EVT_ADDRESS_NACK:
            break;
        case NRF_DRV_TWI_EVT_DATA_NACK:
            break;
        default:
            break;
    }
}


/**
 * @brief UART initialization.
 */
void twi_init (void)
{
    ret_code_t err_code;
    int32_t ret = 0;

    const nrf_drv_twi_config_t twi_bh1792glc_config = {
       .scl                = ARDUINO_SCL_PIN,
       .sda                = ARDUINO_SDA_PIN,
       .frequency          = NRF_DRV_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    NRF_LOG_INFO("before nrf_drv_twi_init.");
    err_code = nrf_drv_twi_init(&m_twi, &twi_bh1792glc_config, twi_handler, NULL);
    NRF_LOG_INFO("finished nrf_drv_twi_init.");
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);

    // BH1792
    m_bh1792.fnWrite      = i2c_write;
    m_bh1792.fnRead       = i2c_read;
    ret = bh1792_Init(&m_bh1792);
    NRF_LOG_INFO("finished bh1792_Init.");
    //error_check(ret, "bh1792_Init");

    m_bh1792.prm.sel_adc  = BH1792_PRM_SEL_ADC_GREEN;
    m_bh1792.prm.msr      = BH1792_PRM_MSR_SINGLE;//BH1792_PRM_MSR_1024HZ;
    m_bh1792.prm.led_en   = (BH1792_PRM_LED_EN1_0 << 1) | BH1792_PRM_LED_EN2_0;
    m_bh1792.prm.led_cur1 = BH1792_PRM_LED_CUR1_MA(1);
    m_bh1792.prm.led_cur2 = BH1792_PRM_LED_CUR2_MA(0);
    m_bh1792.prm.ir_th    = 0xFFFC;
    m_bh1792.prm.int_sel  = BH1792_PRM_INT_SEL_SGL;//BH1792_PRM_INT_SEL_WTM;
    NRF_LOG_INFO("before bh1792_SetParams.");
    ret = bh1792_SetParams();
    //error_check(ret, "bh1792_SetParams");
    NRF_LOG_INFO("finished bh1792_SetParams.");

    //NRF_LOG_INFO("GDATA(@LED_ON),GDATA(@LED_OFF)\n");

    ret = bh1792_StartMeasure();
    //error_check(ret, "bh1792_StartMeasure");
    NRF_LOG_INFO("finished bh1792_StartMeasure.");
}


static void timer_isr(void * p_context)
{
    //UNUSED_PARAMETER(p_context);
    //NRF_LOG_INFO("timer_isr.");
    
    int32_t ret = 0;

    nrf_drv_gpiote_in_event_disable(ARDUINO_10_PIN);

    // became else root, m_bh1792.prm.msr = BH1792_PRM_MSR_SINGLE
    /*
    if (m_bh1792.prm.msr <= BH1792_PRM_MSR_1024HZ) {
      ret = bh1792_SetSync();
      //error_check(ret, "bh1792_SetSync");

