takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
      if (m_bh1792.sync_seq < 3) {
        if (m_bh1792.sync_seq == 1) {
          //tmp_eimsk = 0;
        } else {
          ret = bh1792_ClearFifoData();
          //error_check(ret, "bh1792_ClearFifoData");

          //tmp_eimsk = bit(INT0);
        }
      }
    } else {
    */
      ret = bh1792_StartMeasure();
      //error_check(ret, "bh1792_StartMeasure");
    /*
    }
    */

    nrf_drv_gpiote_in_event_enable(ARDUINO_10_PIN, true);
}


void bh1792_isr(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    int32_t ret = 0;
    //uint8_t i   = 0;

    nrf_drv_gpiote_in_event_disable(ARDUINO_10_PIN);

    ret = bh1792_GetMeasData(&m_bh1792_dat);
    //error_check(ret, "bh1792_GetMeasData");

    // became else root, m_bh1792.prm.msr = BH1792_PRM_MSR_SINGLE
    /*
    if(m_bh1792.prm.msr <= BH1792_PRM_MSR_1024HZ) {
      for (i = 0; i < m_bh1792_dat.fifo_lev; i++) {
        NRF_LOG_INFO("%d", m_bh1792_dat.fifo[i].on);
        NRF_LOG_INFO(",");
        NRF_LOG_INFO("%d\n", m_bh1792_dat.fifo[i].off);
      }
    } else {
      if(m_bh1792.prm.sel_adc == BH1792_PRM_SEL_ADC_GREEN) {
        */
        //NRF_LOG_RAW_INFO("%d,%d,%d,%d\n", m_bh1792_dat.green.on, m_bh1792_dat.green.off, m_bh1792_dat.ir.on, m_bh1792_dat.ir.off)
        NRF_LOG_RAW_INFO("%d,%d\n", m_bh1792_dat.green.on, m_bh1792_dat.green.off)
        /*
      } else {
        NRF_LOG_RAW_INFO("%d,%d\n", m_bh1792_dat.ir.on, m_bh1792_dat.ir.off)
      }
    }
    */
    nrf_drv_gpiote_in_event_enable(ARDUINO_10_PIN, true);
}


// Note:  I2C access should be completed within 0.5ms
int32_t i2c_write(uint8_t slv_adr, uint8_t reg_adr, uint8_t *reg, uint8_t reg_size)
{
    ret_code_t err_code;

    /*
    // m_bh1792.prm.msr      = BH1792_PRM_MSR_SINGLE, none
    if (m_bh1792.prm.msr <= BH1792_PRM_MSR_1024HZ) {
      if((slv_adr != BH1792_SLAVE_ADDR) || (reg_adr != BH1792_ADDR_MEAS_SYNC)) {
        while(FlexiTimer2::count == 1999);
      }
    }
    */

    uint32_t timeout = BH1792_TWI_TIMEOUT;

    twi_tx_buffer[0] = reg_adr;
    memcpy(&twi_tx_buffer[1], &reg[0], reg_size);
    
    err_code = nrf_drv_twi_tx(&m_twi, slv_adr, &twi_tx_buffer[0], reg_size + 1, false);
    if(err_code != NRF_SUCCESS) return err_code;
    while((!twi_tx_done) && --timeout) ;
    if(!timeout) return NRF_ERROR_TIMEOUT;
    twi_tx_done = false;

    //return rc;   //rc is return value that arduino, Wire endTransmission, rc:0 is normal
    return 0;
}


// Note:  I2C access should be completed within 0.5ms
int32_t i2c_read(uint8_t slv_adr, uint8_t reg_adr, uint8_t *reg, uint8_t reg_size)
{
    ret_code_t err_code;

    /*
    // m_bh1792.prm.msr      = BH1792_PRM_MSR_SINGLE, none
    if (m_bh1792.prm.msr <= BH1792_PRM_MSR_1024HZ) {
      while(FlexiTimer2::count == 1999);
    }
    */

    uint32_t timeout = BH1792_TWI_TIMEOUT;

    err_code = nrf_drv_twi_tx(&m_twi, slv_adr, &reg_adr, 1, false);
    if(err_code != NRF_SUCCESS) return err_code;

    while((!twi_tx_done) && --timeout);
    if(!timeout) return NRF_ERROR_TIMEOUT;
    twi_tx_done = false;

    err_code = nrf_drv_twi_rx(&m_twi, slv_adr, reg, reg_size);
    if(err_code != NRF_SUCCESS) return err_code;

    timeout = BH1792_TWI_TIMEOUT;
    while((!twi_rx_done) && --timeout);
    if(!timeout) return NRF_ERROR_TIMEOUT;
    twi_rx_done = false;

    //return rc;  //rc:0 is normal, rc:4 is error. but in nrf5 when case of error, already return
    return 0;
}


/*
void error_check(int32_t ret, String msg)
{
  if(ret < 0) {
    msg = "Error: " + msg;
    msg += " function";
    NRF_LOG_INFO("%s\n", msg);
    NRF_LOG_INFO("ret = ");
    NRF_LOG_INFO("%d", ret);
    if(ret == BH1792_I2C_ERR) {
      NRF_LOG_INFO("i2c_ret = ");
      NRF_LOG_INFO("%d\n", m_bh1792.i2c_err);
    }
    while(1);
  }
}
*/


void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    nrf_drv_gpiote_out_toggle(PIN_OUT);
}


/**
 * @brief Function for configuring: PIN_IN pin for input, PIN_OUT pin for output,
 * and configures GPIOTE to give an interrupt on pin change.
 */
static void gpio_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);
    
    /*
    // LED1
    nrf_drv_gpiote_out_config_t out_config = GPIOTE_CONFIG_OUT_SIMPLE(false);

    err_code = nrf_drv_gpiote_out_init(PIN_OUT, &out_config);
    APP_ERROR_CHECK(err_code);

    // Button1
    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(true);
    in_config.pull = NRF_GPIO_PIN_PULLUP;

    err_code = nrf_drv_gpiote_in_init(PIN_IN, &in_config, in_pin_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(PIN_IN, true);
    */

    // bh1792glc, arudino_10_pin
    nrf_drv_gpiote_in_config_t in_config_bh1792 = GPIOTE_CONFIG_IN_SENSE_HITOLO(true); // interrupt when falling edge
    in_config_bh1792.pull = NRF_GPIO_PIN_PULLUP;

    err_code = nrf_drv_gpiote_in_init(ARDUINO_10_PIN, &in_config_bh1792, bh1792_isr);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(ARDUINO_10_PIN, true);
}


/**@brief Function for handling the BH1792GLC measurement timer timeout.
 *
 * @details This function will be called each time BH1792GLC measurement timer expires.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void bh1792glc_meas_timeout_handler(void * p_context)
{
    //NRF_LOG_INFO("bh1792glc measure timer interrupt.");
    timer_isr(p_context);    
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

