takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
        char restime[] =    "2018-12-25T12:20:15+9";
        char resdatanum[] = ",10";
        char respulse[] =   ",100,101,102,103,104,105,106,107,108,109";
        char restemp[] =    ",36.00,36.01,36.02,36.03,36.04,36.05,36.06,36.07,36.08,36.09";
        char resdata[256] = {};

        // NRF_LOG_INFO("nus_data_handler");

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        // NRF_LOG_INFO("p_evt->params.rx_data.p_data: %s", p_evt->params.rx_data.p_data);
        // for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        for (i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
                //NRF_LOG_INFO("string: %c", p_evt->params.rx_data.p_data[i]);
                com_buf[i] = p_evt->params.rx_data.p_data[i];
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
        com_buf[i] = '\0';
        NRF_LOG_INFO("command: %s", com_buf);
        /*
        err_code = ble_nus_data_send(&m_nus, com_buf, &i, m_conn_handle);
        if ((err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_NOT_FOUND))
        {
            APP_ERROR_CHECK(err_code);
        }
        */
        uint16_t reslength;

        for (i = 0; i < Number_of_command; i++)
        {
          if((strcmp(com_buf, NusCommand[i])) == 0)
          {
              //NRF_LOG_INFO("ack");
              /*
              reslength = 3;
              err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
              if ((err_code != NRF_ERROR_INVALID_STATE) &&
                  (err_code != NRF_ERROR_RESOURCES) &&
                  (err_code != NRF_ERROR_NOT_FOUND))
              {
                  APP_ERROR_CHECK(err_code);
              }
              */
              switch (i)
              {
                  case 0:   // 0: sta
                      reslength = 3;
                      err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                      break;
                  case 1:   // 1: sto
                      reslength = 3;
                      err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                      break;
                  case 2:   // 2: rqs
                      reslength = 3;
                      err_code = ble_nus_data_send(&m_nus, "100", &reslength, m_conn_handle);
                      break;
                  case 3:   // 3: rqd
                      reslength = strlen(restime) + strlen(resdatanum) + strlen(respulse) + strlen(restemp);
                      //char resdata[reslength];
                      strcpy(resdata, restime);
                      //memcpy(resdata, restime, 0);
                      strcat(resdata, resdatanum);
                      strcat(resdata, respulse);
                      strcat(resdata, restemp);
                      NRF_LOG_INFO("res: %s", resdata);
                      err_code = ble_nus_data_send(&m_nus, &resdata[0], &reslength, m_conn_handle);
                      break;
                  default:
                      break;
              }
              if ((err_code != NRF_ERROR_INVALID_STATE) &&
                  (err_code != NRF_ERROR_RESOURCES) &&
                  (err_code != NRF_ERROR_NOT_FOUND))
              {
                  APP_ERROR_CHECK(err_code);
              }
              break;
          }
        }
        if (i == Number_of_command)
        {
            //NRF_LOG_INFO("nak");
            reslength = 3;
            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
            if ((err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != NRF_ERROR_RESOURCES) &&
                (err_code != NRF_ERROR_NOT_FOUND))
            {
                APP_ERROR_CHECK(err_code);
            }
        }
    }

}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_hrs_init_t     hrs_init;
    ble_hts_init_t     hts_init;
    ble_bas_init_t     bas_init;
    ble_dis_init_t     dis_init;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};
    uint8_t            body_sensor_location;
    ble_dis_sys_id_t   sys_id;

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Health Thermometer Service
    memset(&hts_init, 0, sizeof(hts_init));

    hts_init.evt_handler                 = on_hts_evt;
    //hts_init.evt_handler                 = NULL;
    hts_init.temp_type_as_characteristic = TEMP_TYPE_AS_CHARACTERISTIC;
    hts_init.temp_type                   = BLE_HTS_TEMP_TYPE_BODY;

    // Here the sec level for the Health Thermometer Service can be changed/increased.
    //hts_init.ht_meas_cccd_wr_sec = SEC_JUST_WORKS;
    hts_init.ht_meas_cccd_wr_sec = SEC_OPEN;
    hts_init.ht_type_rd_sec      = SEC_OPEN;

    err_code = ble_hts_init(&m_hts, &hts_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Heart Rate Service.
    body_sensor_location = BLE_HRS_BODY_SENSOR_LOCATION_FINGER;

    memset(&hrs_init, 0, sizeof(hrs_init));

    hrs_init.evt_handler                 = NULL;
    hrs_init.is_sensor_contact_supported = true;
    hrs_init.p_body_sensor_location      = &body_sensor_location;

